app/controllers/categories_controller.rb

SELECT "products".* FROM "products"  WHERE "products"."category_id" IN (4, 6)
---
  def show_product
    @products = Product.where(category_id: params[:id])