app/controllers/products_controller.rb

SELECT  "products".* FROM "products"   ORDER BY view desc LIMIT 5
SELECT "categories".* FROM "categories"
---
  def welcome
    @products = Product.all
    @top_view = Product.limit(5).order('view desc')
    @categories = Category.all