app/views/products/welcome.html.erb

        Price: $<%= product.price %><br>
        Category: <%= Category.find_by_id(product.category).name %><br>
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 6]]